AK47n/firstep/library/revise-backups/20260912-133956/mspm0.syscfg
// MAX7219 数码管/点阵（max7219 模块：软 SPI 位操作 3 脚 DIN/CLK/CS，全强推挽
// 输出；位操作不占硬件 SPI 外设；CS 初始高 = 片选空闲。默认 DIN=PB9（与
// DC_MOTOR AIN1 重叠）/CLK=PA18（与 DC_MOTOR AIN2 重叠——PA18 兼 BSL 排针
// 脚，作输出无碍）/CS=PB18（与 DC_MOTOR BIN1 重叠）——大数字显示（计分/
// 计时/数据牌类固定装置）与双电机小车同选概率最低（小车状态显示惯走
// OLED），同选时经引脚绑定消解）

// PCA9685 16 路舵机驱动板（pca9685 模块：软 I2C 位操作 2 脚 SCL/SDA——照
// AHT10 先例不占硬件 I2C 外设；SDA 方向运行时切换（写 = 输出、读 ACK = 输入）。
// 默认 SCL=PB6 / SDA=PB7——与 STEP_MOTOR SLP2/DIR2、HUIDU R3/R4、
// AHT10 SCL/SDA（软 I2C 同型）、DHT11 DATA 重叠：16 路舵机多自由度执行与
// 温湿度采集（环境站类）/步进电机（单轴执行，互替）/8 路灰度巡线（车类）
// 同选概率最低，同选时经引脚绑定消解；软 I2C 需板上/模块自带上拉）

// 红外编码发射（ir_remote_tx 模块：OUT 输出强推挽，38kHz NEC 载波位时序
// CPU 忙等 + delay 模块换算，不占 TIMER（照 ir_remote/ws2812 先例）；初始
// 低 = 载波空闲。默认 PA0——与 I2C_0 SDA（ml_mpu6050 姿态）/板载 LED 重叠
// （红外发射链与姿态采集同选概率最低；板载 LED 随载波闪烁可作发射指示），
// 且与 IR_REMOTE 默认 PA26 刻意错开（发射/接收本就常配对——双选默认即不撞，
// 同选时经引脚绑定消解）

// JQ8900 语音播报（jq8900 模块：软 UART 单发 TX——GPIO 位操作 9600 8N1，
// 不占 UART 外设/TIMER（批次 4 UART 可行性调研：SysConfig CLI 拒绝同一
// UART 外设多实例，语音单向发指令帧走软 UART）；TX 输出初始 SET = 空闲高。
// 默认 PB19——DC_MOTOR 编码器 BA 脚：语音播报与双电机小车同选概率最低，
// 同选时经引脚绑定消解；与同批 syn6288 默认 PB20 刻意错开（语音两件常同选））

// SYN6288 语音合成（syn6288 模块：软 UART 单发 TX——同 jq8900 先例，不占
// UART 外设/TIMER；TX 输出初始 SET = 空闲高。默认 PB20——DC_MOTOR 编码器
// BB 脚：语音合成与双电机小车同选概率最低；与同批 jq8900 默认 PB19 刻意
// 错开（语音两件常同选，默认即不撞），同选时经引脚绑定消解）

// RC522 射频 IC 卡识别（rc522 模块：软 SPI 位操作 5 脚——CS/RST/SCK/MOSI
// 输出 + MISO 输入，单 RC522_PORT 宏；不占硬件 SPI 外设（nrf24l01 先例）。
// 默认 CS=PA7（DC_MOTOR BIN2 + SERVO_PWM 重叠）/RST=PA18（DC_MOTOR AIN2 +
// MAX7219 CLK）/SCK=PA14（DCC_100_PWM2 + WS2812 IN）/MOSI=PA16（编码器
// AA）/MISO=PA17（编码器 AB）——读卡与车类（双电机/舵机/步进）同选概率
// 最低，同选时经引脚绑定消解；五脚全 GPIOA 单口，与同批语音/指纹默认不撞）

// 指纹模块触摸感应输入（fingerprint 模块：模块 5 脚触摸信号输出高 = 检测到
// 触摸，VTI 接 3.3V——直连 GPIO 输入即可。默认 PA12——PWMAB C0（motor 双路
// PWM）+ BH1750 SCL 重叠：指纹与双电机/光照同选概率最低，同选时经引脚绑定
// 消解；与同批 jq8900/syn6288/rc522 默认不撞）

// LED/蜂鸣器输出（PA15；原 LaunchPad 值 PA3 = 32.768k 晶振脚，地猛星排针未引出）
LED_BEEP.$name = "LED_BEEP";
LED_BEEP.associatedPins.create(1);
LED_BEEP.associatedPins[0].$name        = "LED";
LED_BEEP.associatedPins[0].direction    = "OUTPUT";
LED_BEEP.associatedPins[0].initialValue = "CLEARED";
LED_BEEP.associatedPins[0].pin.$assign  = "PA15";

// 步进电机方向/使能（step_motor 模块：宏 STEP_MOTOR_RST2/SLP2/DIR2/DCY2_PIN，
// 四脚同 GPIOB → STEP_MOTOR_PORT = GPIOB；RST2/SLP2 空闲高有效，init 置高）

// IMU 串口（RX 中断；UART0 = PA28(TX)/PA31(RX)——板载 CH340E 占用 UART0 默认脚
// PA10/PA11，勿用；imu_uart 模块接线注释同步此值）
IMU601.$name             = "IMU601";
IMU601.profile           = "CONFIG_PROFILE_1";
IMU601.peripheral.$assign = "UART0";
IMU601.uartClkSrc        = "BUSCLK";
IMU601.ovsRate           = "16";
IMU601.targetBaudRate    = 115200;
IMU601.enableInternalLoopback = false;
IMU601.enabledInterrupts = ["RX"];
IMU601.enableFIFO        = false;
IMU601.peripheral.rxPin.$assign = "PA31";
IMU601.peripheral.txPin.$assign = "PA28";

// K230 视觉串口（digit_uart/coord_detect 模块用，RX 中断；PA8/PA9 = UART1）

// 调试串口（debug_uart 模块用，RX 中断；UART2 = PA23(TX)/PA22(RX)。
// 与 UWB_UART 默认同 UART2——两模块同选时经引脚绑定换实例消解；
// PA23/PA22 与 HUIDU L2/L1 默认重叠，同选时改绑消解）

// UWB 定位串口（uwb_uart 模块用，RX 中断；UART2 = PA23(TX)/PA24(RX)。
// PA23/PA24 与 HUIDU L2/L3 默认重叠——两模块同选时经引脚绑定消解）

// Zigbee DL-20 串口（zigbee_uart 接收 / zigbee_uart_key 发送共享，
// RX 中断；UART3 = PA26(TX)/PA25(RX)。PA26/PA25 与 HUIDU R2/R3 默认
// 重叠——同选时经引脚绑定消解）

// HC05 蓝牙串口（hc05 模块：9600 8N1 透传——HC05 模块出厂默认波特率，与
// 其余 UART 实例 115200 独立无冲突；RX 中断 + FIFO 关闭；与 DEBUG_UART/
// UWB_UART 默认同 UART2 外设——两模块同选时经引脚绑定换实例消解；默认
// TX=PA23/RX=PA24 与 UWB_UART 同脚：蓝牙手机遥控与 UWB 定位链路互替、
// 同选概率最低，同选时经引脚绑定消解）

// 指纹识别（fingerprint 模块：AS608 串口双向——独立 UART 实例，批次 4 UART
// 可行性调研实证 SysConfig CLI 拒绝同一 UART 外设多实例，故不共享；默认
// UART0（IMU601 原脚 PA28/PA31——身份与姿态同选概率最低，单选裁剪后独占
// UART0，同选时经引脚绑定换实例消解）；57600 = 页面注释 AS608 默认波特率
// （市售 9600 出厂版改 targetBaudRate 一行即可，协议与波特率无关）；
// enabledInterrupts 空 = **轮询接收**（不注册 UART 中断、无 ISR 强符号）

// OpenMV4 视觉串口（open_mv4 模块：主控侧 UART 帧解析 `[cx,cy]`——真实 UART
// 独立实例照 fingerprint「裁剪后独占」先例（批次 4 UART 可行性调研：SysConfig
// CLI 拒绝同一 UART 外设多实例、UART 实例上限 4 = UART0-3 外设数——母版 7 个
// UART 实例定义每工程先裁剪、裁剪后至多 4 实例，open_mv4 与另 ≤3 件 UART
// 模块同选在限内、4 件以上同选 = CLI 拒绝（既有约束类，notes 写明）；
// 同外设多实例同选时经引脚绑定换实例/换脚消解）；默认挂 UART1（页面原接线
// 「PA8/PA9 附加串口 1」，与 DIGIT_UART（K230 视觉）同外设同脚——OpenMV4 与
// K230 视觉互替、同选概率最低，单选裁剪后独占 UART1）；9600 = 页面案例波特率
// （独立于其余 115200 实例）；enabledInterrupts 空 = **轮询接收**（无 ISR
// 强符号——照 fingerprint 先例）

// AS32-TTL-100 LoRa 无线数传（as32 模块：真实 UART 双向透传——照
// fingerprint/open_mv4「裁剪后独占」先例（批次 4 UART 可行性调研：SysConfig
// CLI 拒绝同一 UART 外设多实例、UART 实例上限 4 = UART0-3 外设数——母版
// 9 个 UART 实例定义每工程先裁剪、裁剪后至多 4 实例；as32 与另 ≤3 件 UART
// 模块同选在限内、4 件以上同选 = CLI 拒绝（既有约束类，notes 写明））。
// 默认挂 UART3（ZIGBEE_UART 宿主——LoRa 与 Zigbee 无线数传互替、同选概率
// 最低，单选裁剪后独占 UART3；默认 TX=PA26/RX=PA25 = ZIGBEE_UART 原脚，
// 互替件同脚先例：OPENMV4_UART/PA8/PA9 与 DIGIT_UART 同构，同选时经引脚
// 绑定换实例/换脚消解）；9600 = 页面/AS32 出厂默认波特率（独立于其余
// 115200 实例；HC05 9600 先例）；enabledInterrupts 空 = **轮询接收**（无
// UART_3_INST_IRQHandler 强符号——zigbee_uart 为 RX 中断件，轮询避免同实例
// 名 ISR 重复；fingerprint/open_mv4 轮询先例，页面 LOAR_Init 的 NVIC 段随
// 轮询裁剪）；页面无 AT 指令代码（参数经上位机设置——AT 配置范围外）

// OLED（I2C 控制器）

// MPU6050 姿态传感器（ml_mpu6050 模块：I2C_0_INST，轮询控制器模式；
// I2C0 = PA0(SDA)/PA1(SCL) 复用板载 LED 脚，通信期间 LED 微闪——地猛星 I2C0 的
// 另一组 PA28/PA31 已给 IMU601 UART0；PA1 板载 4.7k 上拉，PA0 上拉未焊 R12、
// 依赖 MPU6050 模块板自带）

// adc 模块 + 摇杆 + 模拟量测距 + 气体传感 + 火焰/土壤传感共享 ADC12_0（b1-adc-servo/01 +
// wiki-modules-batch1/01 + wiki-modules-batch2/02/04 +
// wiki-modules-batch7/01/02 + wiki-modules-batch8/01/02：
// MEM0=PA24/A0_3 归 adc（us016/mq2 薄封装共读同槽——wiki-modules-batch2/02
// 与 batch6/03），MEM1=PA26/A0_1、
// MEM2=PA25/A0_2 归 joystick X/Y，MEM3=PA27/A0_0 归 ir_distance 红外测距
// （手册原脚），MEM4=PB20/A0_6 归 mq135、MEM5=PB24/A0_5 归 mq5（独立通道
// ——与 mq2 的 MEM0 薄封装不同：多路气体同选时各器件物理通道独立、无共读
// 冲突；2026-09-08 SysConfig CLI 实证 MEM4-7 通道/脚全合法），MEM6=PA22/A0_7
// 归 flame 火焰传感（独立通道——火焰 AO 为高阻电流源，取剩余通道中唯一
// 无负载脚 PA22；与 HUIDU L1/DEBUG_UART RX/NRF24L01 IRQ/TTP224 OUT1 重叠，
// 与巡线/无线/触摸不同框、同选概率最低），MEM7=PA14/A0_12 归 soil 土壤湿度
// （独立通道——**MEM 槽位已满（8/8）**：后续 ADC 类件（photoresistance/rain/
// gp2y1014au/s12sd/ms1100——wiki-modules-batch9/01-04，mq3/mq4/mq6/mq7/mq8/mq9/
// ms1100——wiki-modules-batch11/01-07 同构快补）一律薄封装共读 MEM0（mq2/us016
// 先例——多件同选
// 同读一物理通道、一次转换一次读、采样节奏按用途自协调）；PA14 板载
// LED2+15k 为固定比率衰减（读数系统偏小、单调性保留），与 DCC_100_PWM2/
// WS2812 IN/RC522 SCK/AGS10 SDA 重叠——浇花/智慧农业与运动/读卡/气体不同框、
// 同选概率最低）；
// 轮询读取不配
// 中断。多 MEM 必须 sequence 模式（startAdd..endAdd = 启用 MEM 集合）——
// 单发模式只启用 startAdd 槽位，adcPin1/2 由此不可用（原注释「槽位不存在」
// 系误判，2026-09-05 SysConfig CLI 实证）
const Board = scripting.addModule("/ti/driverlib/Board", {}, false);
Board.configureUnused = true;

SYSCTL.forceDefaultClkConfig = true;
SYSCTL.clockTreeEn  = true;
// LED 多实例通道（module-multi-instance/03 渲染产物：实例名 LED_<实例号>，改引脚只改 $assign）
